GetStreamUri.xml

<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <trt:GetStreamUri>
      <trt:StreamSetup>
        <trt:Stream>RTP-Unicast</trt:Stream>
        <trt:Transport>
          <tt:Protocol>RTSP</tt:Protocol>
        </trt:Transport>
      </trt:StreamSetup>
      <trt:ProfileToken>IPCProfilesToken1</trt:ProfileToken>
    </trt:GetStreamUri>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
